[
  {
    "id": 71632,
    "category": {
      "category_id": "0",
      "category_value": "main_game"
    },
    "collection": 2449,
    "cover": 42594,
    "created_at": 1506675676,
    "external_games": [152876, 1868210],
    "franchises": [872, 874],
    "genres": [
      {
        "genres_id": "15",
        "genres_value": "Strategy"
      }
    ],
    "keywords": [78, 394, 960, 1033, 2458],
    "name": "Ganbare Goemon: Mononoke Sugoroku",
    "similar_games": [
      6985, 18623, 19164, 19404, 23345, 35371, 36553, 55029, 79134, 119156
    ],
    "slug": "ganbare-goemon-mononoke-sugoroku",
    "summary": "A compilation of the first two Super Famicom Goemon games.",
    "tags": [
      17, 22, 27, 268435471, 536870990, 536871306, 536871872, 536871945,
      536873370
    ],
    "themes": [17, 22, 27],
    "updated_at": 1686031007,
    "url": "https://www.igdb.com/games/ganbare-goemon-mononoke-sugoroku",
    "websites": [355140],
    "checksum": "f5349ec4-124d-0812-e7cb-704a2d84dd17"
  },
  {
    "id": 160939,
    "category": {
      "category_id": "1",
      "category_value": "dlc_addon"
    },
    "created_at": 1627934426,
    "external_games": [2077605],
    "genres": [
      {
        "genres_id": "32",
        "genres_value": "Indie"
      }
    ],
    "name": "Tiger Tank 59 I: A-Gun MP095",
    "parent_game": 110980,
    "screenshots": [562356, 562358, 562365, 562372, 562377],
    "similar_games": [
      32902, 37419, 40524, 76263, 96217, 105233, 106987, 111130, 113895, 119121
    ],
    "slug": "tiger-tank-59-i-a-gun-mp095",
    "summary": "\"Tiger Tank 59\" is a top-down shooting game. Players need to control their tanks, through the enemy lines, break the enemy base, or defeat the enemy tanks. This DLC contains the Map No.491-495.",
    "tags": [1, 268435488],
    "themes": [1],
    "updated_at": 1685761108,
    "url": "https://www.igdb.com/games/tiger-tank-59-i-a-gun-mp095",
    "websites": [207860, 207861],
    "checksum": "6bc319a3-3d9c-8308-576b-c102901b8b65",
    "language_supports": ["English"],
    "steam": "1667954",
    "reviews": []
  },
  {
    "id": 130740,
    "category": {
      "category_id": "0",
      "category_value": "main_game"
    },
    "created_at": 1582360476,
    "external_games": [1617427, 1911867],
    "name": "Deathmatch Club",
    "slug": "deathmatch-club",
    "updated_at": 1670968762,
    "url": "https://www.igdb.com/games/deathmatch-club",
    "websites": [386427],
    "checksum": "2504a9b2-c115-0252-9f5a-850ff9924a4f"
  },
  {
    "id": 137195,
    "age_ratings": [
      {
        "age_rating_category": {
          "age_rating_category_id": 6,
          "age_rating_category_value": "CLASS_IND"
        },
        "age_rating_rating": {
          "age_rating_rating_id": 29,
          "age_rating_rating_value": "CLASS_IND_Ten"
        }
      },
      {
        "age_rating_category": {
          "age_rating_category_id": 2,
          "age_rating_category_value": "PEGI"
        },
        "age_rating_rating": {
          "age_rating_rating_id": 3,
          "age_rating_rating_value": "Twelve"
        }
      },
      {
        "age_rating_category": {
          "age_rating_category_id": 1,
          "age_rating_category_value": "ESRB"
        },
        "age_rating_rating": {
          "age_rating_rating_id": 9,
          "age_rating_rating_value": "E10"
        }
      },
      {
        "age_rating_category": {
          "age_rating_category_id": 5,
          "age_rating_category_value": "GRAC"
        },
        "age_rating_rating": {
          "age_rating_rating_id": 24,
          "age_rating_rating_value": "GRAC_Twelve"
        }
      },
      {
        "age_rating_category": {
          "age_rating_category_id": 7,
          "age_rating_category_value": "ACB"
        },
        "age_rating_rating": {
          "age_rating_rating_id": 35,
          "age_rating_rating_value": "ACB_PG"
        }
      },
      {
        "age_rating_category": {
          "age_rating_category_id": 4,
          "age_rating_category_value": "USK"
        },
        "age_rating_rating": {
          "age_rating_rating_id": 20,
          "age_rating_rating_value": "USK_12"
        }
      }
    ],
    "aggregated_rating": 65.0,
    "aggregated_rating_count": 3,
    "alternative_names": [65648, 105850, 117666],
    "artworks": [11731, 68424],
    "bundles": [263897],
    "category": {
      "category_id": "9",
      "category_value": "remaster"
    },
    "collection": 7103,
    "cover": 232868,
    "created_at": 1598520979,
    "external_games": [
      1883673, 2440052, 2533073, 2568678, 2593265, 2593515, 2593572, 2593860,
      2658599
    ],
    "first_release_date": 1644796800,
    "follows": 1,
    "franchises": [3390],
    "game_engines": [1543],
    "game_modes": [
      {
        "game_modes_id": "1",
        "game_modes_value": "Single player"
      },
      {
        "game_modes_id": "2",
        "game_modes_value": "Multiplayer"
      }
    ],
    "genres": [
      {
        "genres_id": "4",
        "genres_value": "Fighting"
      },
      {
        "genres_id": "25",
        "genres_value": "Hack and slash/Beat 'em up"
      },
      {
        "genres_id": "31",
        "genres_value": "Adventure"
      },
      {
        "genres_id": "33",
        "genres_value": "Arcade"
      }
    ],
    "involved_companies": [194995, 194996],
    "name": "River City Girls Zero",
    "parent_game": 46584,
    "platforms": [
      {
        "platforms_id": "6",
        "platforms_value": "PC (Microsoft Windows)"
      },
      {
        "platforms_id": "48",
        "platforms_value": "PlayStation 4"
      },
      {
        "platforms_id": "49",
        "platforms_value": "Xbox One"
      },
      {
        "platforms_id": "130",
        "platforms_value": "Nintendo Switch"
      },
      {
        "platforms_id": "167",
        "platforms_value": "PlayStation 5"
      },
      {
        "platforms_id": "169",
        "platforms_value": "Xbox Series X|S"
      }
    ],
    "player_perspectives": [2, 4],
    "release_dates": [345917, 387770, 387772, 387773, 389364, 406085],
    "screenshots": [740764, 740765, 740766, 740767, 740768],
    "similar_games": [
      76253, 87622, 90011, 101608, 103168, 103369, 111130, 114145, 115283,
      117533
    ],
    "slug": "river-city-girls-zero",
    "summary": "River City Girls Zero lets you experience the first time that Misako and Kyoko teamed up with Kunio and Riki to take to the streets in hard-hitting, curb-stomping action. While the graphics, music, and gameplay all remain true to the classic 16-bit Super Famicom release, this version marks the first time the 1994 game will be localized for the West. A new opening cinematic, new manga cutscenes, and new theme song by River City Girls composer Megan McDuffee have been added as well. Set out solo or team up with a friend in local co-op and discover how the River City Girls story began!",
    "tags": [1, 268435460, 268435481, 268435487, 268435489],
    "themes": [1],
    "total_rating": 65.0,
    "total_rating_count": 3,
    "updated_at": 1701460057,
    "url": "https://www.igdb.com/games/river-city-girls-zero",
    "videos": [64610],
    "websites": [186924, 186925, 186929, 265585, 283677, 369475],
    "checksum": "170d53e6-afa5-aac7-b6c4-31a00218ebda",
    "language_supports": ["English"],
    "game_localizations": [2026, 13450],
    "steam": "1851020",
    "reviews": [
      {
        "review": "I'm gonna be straight up right off the bat, don't buy this game if you aren't prepared for a lot of unfair combat and a fair amount of frustration. This is a modern re-release of a game that comes from the era of old school trial by fire. It doesn't care about being fair, and it doesn't care how many times you lose. If you want to know more, read on.The biggest issue that this game has is unfair enemy behavior. You'll often find yourself spamming punches and kicks, that in any other game would be part of an unbreakable combo chain, but in this game, enemies will nonchalantly start hitting you right through whatever combo you're in the middle of. This is the most common occurrence of the game, and defines most of the combat experience here. What's worse is that all the enemies in the game are tanks, requiring more damage than what feels reasonable to take even just one of them down. You're going to be frequently outnumbered, taking tons of unfair damage, which is going to compel most players to start playing in an exploitative fashion. You do have infinite lives, but not every checkpoint is forgiving, so if you aren't ready to deal with that, this isn't for you.You play as all four River City characters in this game, swapping them out on the fly, which should have been cool, but it kinda isn't. I say that because although you can swap them all out on the fly, they each have their own individual health bars, which sounds okay, until you discover that if one of them dies, they all die. The game basically makes you flirt with death, swapping out characters before they die, which essentially equals the player having less health. This could have been a reasonable gameplay mechanic if all four of the characters offered a different playstyle from one another, but they don't. The boys play identically to one another; the girls play identically to one another; and the boys and girls differ ever so slightly from one another. In theory, this means you actually would have been better off just playing as a single character with an extended health bar, equal to all four.Am I being way too harsh here? Kinda. This is a really old game, and the standards were different back then. If I'm being honest with myself, if I had this game as a kid, I actually think I would have loved it. It's an unfair game, no doubt, but if you grew up in the 90's, that's nothing new, and being unfair certainly didn't stop these kinds of games from being a good time (not always). The combat is still fun enough, the environments are interesting, and the game has a decent amount of pre-fight dialogue before boss encounters, giving every fight context and purpose (which wasn't very common for beat'em'up games in the era this was made in). Co-op is probably not a bad time with this one either, though I haven't tried that to speak too much on it, so I won't.Given that this is 2022 though, some folks might be compelled to judge this game off the backs of more recent games like the original River City Girls, Mother Russia Bleeds, and Streets of Rage 4. Does this have anywhere near the same modern day sensibilities that those games have? No. Duh, right? But still, just as a fair warning to anyone born after the year 2000, I know that your first experience with River City games is likely 2019's River City Girls. Just know that this is a vastly different beast from that game. Don't expect ANY of the humor of that game here, nor a catchy soundtrack that will make you want to own the songs (aside from the awesome intro song which was added in just for this release), nor any of the RPG elements. THIS-IS-DIFFERENT. The game does include a tailored intro that features the girls in their modern day forms, and it's pretty cool, but that's about all that this game has in connection with the previous one. The playable portion of this will punish you, as most of the games from its time did.P.S. This game dawns the name River City Girls, but that's just for brand recognition due to the popularity and success of the 2019 game. This is more about Kunio and Rikki than it is about the girls.",
        "author": "Sixth",
        "recommended": true,
        "postedDate": "21 September, 2022"
      },
      {
        "review": "A modern day re-release of the last entry for the Nekketsu Koha series in the Kunio-kun franchise placed into the River City Girls spinoff series. This release was a split project between WayForward who handled all of the translations & newly added visuals wrapped around the game with Limited Run Games handling the original game itself. WayForward chose to take this project on as a way to serve as an origin story for Misako & Kyoko's playable debuts in the franchise with many of the events & characters in this game to be referenced in the upcoming River City Girls 2.Without any source code being available for the project, emulation was used on the Carbon engine which was originally made for Shantae GBC's re-release on the Switch. Nothing was changed about the original game apart from being available in other languages so any issues from then remain present here. The emulator runs fine, though backing in & out of a game may sometimes cause game audio to cut out entirely or other similar issues at the time of writing.From the gameplay side of things this plays well enough and should feel pretty familiar to those who've played the original arcade game or Technos' other franchise Double Dragon. Playing this present day the controls can feel stiff compared to the Downtown Nekketsu beat em' up games seen on the NES and especially to those who might be coming straight out of River City Girls' modern approach. You're using your punch & kicks throughout with the boys being able to perform grabs and the girls being able to move & attack faster. The game is played in a stage-by-stage linear fashion and certainly doesn't overstay it's welcome in the total length with you being able to clear the whole thing in a couple of hours dependant on how many times you die throughout.What I'd say to be the real meat & potatoes would have to be the story. The Koha series of Kunio games were all made with relatively darker & serious themes in mind in comparison to the others and this is no exception. WayForward provides two options for the script with those either being the original 1994 script or a flavoured version edited to sound more like the characters' River City Girls counterparts. Both scripts provide a good experience throughout!The biggest flaw the PC version has is that there's no sort of settings menu at all. Your volume, window size, full screen, or keyboard controls cannot be changed at all or must be manually done. If all of this is not an issue or you're playing on a controller then in it's current state I can suggest the PC version. If any of these are an issue but you'd still like to purchase a copy of the game instead of resorting to playing the old fan translation then I'd recommend any of the console releases. The game itself is more than fine but the PC version in specific needs some more work done.",
        "author": "mr burns",
        "recommended": true,
        "postedDate": "23 September, 2022"
      },
      {
        "review": "First off: There are 2 possible translations possible in English. An original adaptation to make it flow better with river city girls 1 and a new one which is a close translation to the Japanese. The devs listened to feedback and provided extra options which is to be commended. What is this game? This is a very old school brawler. This was a \"graphical update\" from the nes sprites of the original and I the only game in the \"kunio\" or \"river city ransom\" series that seems to use these sprites. There are also no rpg elements in this one. You can't pop in a shop to eat, buy skill books or anything like that. It's pure action. True to form, the Japanese only uses hiragana and kana for text and it is hard to read due to the low resolution.The story is a bigger deal and a bit the beginning is a bit darker than the typical kunio game. The title is also a bit misleading since the girls are playable, but the main stars are kunio and riki. The Japanese title makes that a bit more clear. You eventually have 4 characters, which can be shared with another player (regardless if they own the game or not) or you can use all 4 for yourself and switch them out. In single player at least, if anyone of them get knocked out, you lose. You need to switch before they get KOed. What is a bit unusual for this game is that the enemies have more combo priority than you do. Most brawlers or fighting games have a kind of hit stun after you hit someone or invincibility frames. You don't get that here; your combos will be broken by the guy you are wailing on, if they feel like it. That doesn't work both ways though, you can't really break out of a combo yourself. Think of it this way: in case of a tie, the player loses. In modern games it is the opposite. This is the source of the perceived difficulty of the game. Therefore, I found that the best way to fight is to knock them down with one hit. The good ol jump kick them to death technique from back in the day is back. Some reviews commented that all 4 characters are essentially the same and just a lifebar. This is incorrect and it only seems that way at the beginning: the special moves are different and the girls slap instead of punch which seems slightly easier to finish combos with than punches. I am not sure on damage numbers but according to a guide a steam, not all attacks do the same amount of damage.The remastering of this game adds a link to the newest river city girl through an intro comic and opening. I like how the song sounds slightly distorted like it was recorded in the 80s. You can also add some filters but I didn't see a huge difference other than the CRT filter. Another addition is the use of saving. The old game used a password system. You input a password and it brings you to that stage. You can use either. This allows you to skip parts of the game if you like. The game isn't terribly long but you may prefer some stages over others when replaying. For more Japanese games on pc check out https://store.steampowered.com/curator/33962119-Japanese-Games-On-PC/",
        "author": "Delicious Banchou",
        "recommended": true,
        "postedDate": "1 October, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "Still a great classic beat em up, no doubt about it. 4 characters, variety in levels, funny story.The only new addition to the original Shin nekketsu kōha Kunio-tachi no banka game is the fully voiced intro & outro.Sadly it doesn't have online coop other than through Steam remote-play.",
        "author": "Elf Kaicho",
        "recommended": true,
        "postedDate": "27 January\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "It's an old game, don't expect it to hold your hand. It lets you beat em up alright, but it is a little stiff in comparison to recent releases. Loved it's soundtrack and tone,",
        "author": "REUMOSAN",
        "recommended": true,
        "postedDate": "18 December, 2022"
      },
      {
        "review": "I feel this game is more charming than River City Girls 1&2. Maybe because of the tone of story. Maybe because of the hardcore& challenge fight.",
        "author": "SuperKeyboardFighter",
        "recommended": true,
        "postedDate": "17 December, 2022"
      },
      {
        "review": "A nice piece of gaming history but not for everyone.If you like old-school Beat'em ups or are a fan of River City Girls you're probably gonna like this game if only to see the first apperance of Misako and Kyoko.I also think that it's important that older games are accessible to a main-stream audience without having to resort to piracy or spending a ridiculous amount of money.",
        "author": "Rei",
        "recommended": true,
        "postedDate": "19 January"
      },
      {
        "review": "🏍️ This game came out in 1994 (16-bit golden era, with a lot of top-notch titles), but it plays like it's from the late 80s at the most. The plot has always been pretty funny, but the further you go through it, the more dishonest the game becomes, to the full test of your patience and luck. The hitboxes are terrible and the controls are lag. Fortunately, the lives in this release are infinite and you can save the state of the game at any time. So why is the feedback positive? Only because of the re-release approach. The new cutscenes & soundtrack OUTSIDE of the game are just amazing and I'll always be grateful for the new and fresh breath in the Kunio-kun series called «River City Girls».",
        "author": "❥ SexySexyLover",
        "recommended": true,
        "postedDate": "7 June"
      },
      {
        "review": "Remember the name Ken, you will hate him. Great Music, great Vive, loving that game.",
        "author": "533D",
        "recommended": true,
        "postedDate": "21 September, 2022"
      },
      {
        "review": "i am a Kunio-Kun fan for over a decade and i have played many good classic Kunio-Kun games through out these time.\"River City Girls Zero\" or what i like to call \"Shin Nekketsu Kouha: Kunio-Tachi no Banka\" it's one of good games from the SNES, and personally i think this game is the game Kunio-Kun Game from the SNES library because of it gameplay, graphic design, soundtrack, story, everything. saddly this game like many kunio-kun games didn't go outside of japan during that time and many people tried to make a translated version of that game.about the \"River City Girls Zero\", it just an emulated rom of the game \"Shin Nekketsu Kouha: Kunio-tachi no Banka\" from 1994 with the only difference that it's officially translated with two different translation to choose.a good thing about this game is that it have a save feature, which it's helpful since it means it save the game if you decide to continue the game later without putting the password, which the password system is still there and you can enter the old passwords to get inside of different levels.now the bad thing about this game that totally turn me off is that they trying to make this game part of the whole River City Girls' universe soo hard, you can tell by this intro and ending of the game whenever you start or finish the story that they put a comic like animation of Misako and Kyouko playing the SNES game and commenting about it.altho the game emulates the rom pretty well, the options are a mess.first off, you can't change the button configuration for the keyboard and instead you have to guess what button does. this is a problem because it kinda make us play in a unconfortable way, most of the time i mess up a move because of the configuration.secondly, the filter option is kinda bugged. when you press left to browse around it got to the point the the option started to glitch out and change many letter and symbols soo fast. it's weird to see this kind of thing because usually i'll expect this kind of error happen on old and baddly programed game from the 80's or 90's, not from a game that came recently.speaking of the filters, it's kinda weird that only have OFF and CTR as an option, you would expect more options considerating that this game was made by a company and not some indie group that does it for fun. atleast they would have putted a semi-blurry filter like how some emulators have, just to hide some of the stretched pixels that i came across while i was playing this game.the worst thing about this game is it theme song that you have to hear from the opening and the title screen. the lyrics are just bad and kinda cringe.not to mention, the intro of the game feature Yamada getting beat up by the main cast, even tho Yamada is no where to be seen on \"Shin Nekketsu Kouha: Kunio-Tachi no Banka\".but what is more shameful is that they trying to make this game from 1994 to be part of this River City Girls universe that WayFoward make, regarless if they just misguide the newest fans of the series or not.personally, the game from 1994 was very good, but this port is something that i cannot stand. it's well emulated with save feature and a true translation. but that felt short with the problems i came across playing this game.i don't support WayForward.but i do support Technos Japan Corp.",
        "author": "GreatMasterFrank",
        "recommended": false,
        "postedDate": "27 September"
      },
      {
        "review": "Kyoko always was better than your mom",
        "author": "VictorSoul",
        "recommended": null,
        "postedDate": "3 December\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "Okay, look.I'm not COMPLETELY against rereleases that are just emulated. At least if they bother adding extra things like sleek menus/UIs, standard emulation features, or cool extras. Mega Collection type stuff.I don't HATE the game itself. And it's cool that they added extra cutscenes, those look absolutely GORGEOUS with WayForward's usual animation magic....But WHY in the name of everything that is good is this rerelease lacking basic features like being able to remap your controls???Or ACTUAL save slots?...Or even being able to move or copy the artificial \"saves\" (it's savestates) that this rerelease uses? (which you only get three of by the way, compared to the 9+ that most standard emulators have)WHY are the default keyboard controls so up-the-ass? Why does the game arbitrarily pick your control device for you when starting the game, so even if you're navigating menus with your keyboard the game just locks out and FORCES you to use a random connected controller instead? With no way to change the control device manually, or hell, even LOOK AT THE DEFAULT CONTROLS AGAIN until you quit out of the game completely?Again, i don't DISLIKE the game itself, but if this rerelease is gonna be THIS basic, give me nothing more than flavor text animated cutscenes, and is going to be missing basic features and even basic polish, then why would I not just stick to playing the original version of this game instead?On the actual console or on a regular emulator where you can have even more features than this has?It's not like there AREN'T translation patches for the original game out there already...I guess this is FINE if you really just want a modern official release of the game, but without features as basic as control remapping and with barely any extras to justify a release of this type I really can't recommend it unless you get it on an extremely cheap sale.At that point they should've probably given WayForward a bigger budget to remake the game completely instead of haphazardly emulating a game they'd lost the source code to.",
        "author": "LazyTomato",
        "recommended": null,
        "postedDate": "16 November"
      },
      {
        "review": "Enemies are way too stronger than player characters, and like other players noted, game play is absolutely unfair. While you can give them 2 punches, they can easily throw you back 4 punches AND a couple of stomping. Extremely tough to play and simply just irritating. Game system is also messed up and easily get confused at how to figure out how to restart the game at where you were left off.  Also, there is not option to change the screen setting. Almost there is NO setting you can change in the game. Do NOT recommend.",
        "author": "tokyojesus",
        "recommended": null,
        "postedDate": "22 July"
      },
      {
        "review": "How come I'm the only person reviewing this thing? Anyway, no beat em up should take an hour of cutscenes to just start playing and the audio is delayed by like 20 seconds, making it almost unplayable. I really like some of the Kunio-kun games and both river city girls but can't recommend a poorly-made port.The intro is very pretty and the cutscenes seemed promising but not enough to spend money on this.",
        "author": "Poplar Lover",
        "recommended": null,
        "postedDate": "17 April"
      },
      {
        "review": "works well on steam deck",
        "author": "Dagger",
        "recommended": null,
        "postedDate": "1 April\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "The translation is good, the new cutscenes and extras are good. But I kind of expect a bit more from Wayforward remakes. For example, the Wonder Boy series was an amazing, super-responsive remake with original and updated graphics. If you didn't go out of your way to switch to retro music and graphics, you wouldn't even know the game was as old as it was. That remake polished an old classic and showed how great the source material was. But look at this trash.I mean, this is the same company that makes the Shantae games. Why did they release a game that wasn't fun and use the excuse of being true to the original? Where are the portraits when talking? The smoothed animations and effects? Why stop at just recreating MODE 7 effects? Why stick solely to the password system and not implement game saves? Why not redo the art and stages and take advantage of better resolution and widescreen? Why not make ways to speed up the atrociously slow dialogue?, or clean up the fonts? Why not properly use all the extra buttons?This literally feels like playing a translated rom on a SNES emulator. Yeah, there's cutscenes and music changes. But the moves are spongy, the hitboxes unclear, movement is sluggish, and the graphics are pulled straight from the SNES. The original was for hardcore fans who wanted to play all the series, and because of that, the original devs didn't bother to make fun gameplay. It played generic-AF, but was particularly cheap about solid gameplay. A faithful port with cutscenes is lipstick on a pig. I'd rather watch someone else play this than play it myself.Honestly, with both Wayforward and Arc System Works, who both understand 2D and fighting games, I would have expected them to at least tweak the input and game engine for a smooth, fun play game - with an *option* to use the sub-par original gameplay. Kunio games have a ton of potential if devs look to iterate and improve. If you're making a direct port with box/concept art extras, you don't provide any additional value in a market full of emulators. That's why the PS2-era classic game re-releases were so forgettable.I honestly stopped playing after a half-hour. I expected much better from all parties involved. Guess I've got another game to ignore.",
        "author": "Ｎｙａｎｂｏｙｅ",
        "recommended": null,
        "postedDate": "3 February"
      }
    ],
    "companies": [
      {
        "company_id": 28729,
        "company_name": "WayForward"
      }
    ]
  },
  {
    "id": 230654,
    "alternative_names": [120224],
    "bundles": [230749, 230823, 230826],
    "category": {
      "category_id": "0",
      "category_value": "main_game"
    },
    "created_at": 1673373573,
    "external_games": [2637109],
    "first_release_date": 1217548800,
    "involved_companies": [199895],
    "name": "Hockey de Mesa",
    "platforms": [
      {
        "platforms_id": "64",
        "platforms_value": "Sega Master System/Mark III"
      }
    ],
    "release_dates": [436853],
    "slug": "hockey-de-mesa",
    "updated_at": 1694043204,
    "url": "https://www.igdb.com/games/hockey-de-mesa",
    "checksum": "8a5c4a96-44c3-bc49-1f19-98f931fe4a9d"
  },
  {
    "id": 203546,
    "artworks": [77689],
    "category": {
      "category_id": "0",
      "category_value": "main_game"
    },
    "cover": 260350,
    "created_at": 1654531440,
    "external_games": [2443744, 2446156],
    "first_release_date": 1654560000,
    "genres": [
      {
        "genres_id": "31",
        "genres_value": "Adventure"
      },
      {
        "genres_id": "32",
        "genres_value": "Indie"
      }
    ],
    "name": "Meat & Greed",
    "platforms": [
      {
        "platforms_id": "6",
        "platforms_value": "PC (Microsoft Windows)"
      }
    ],
    "release_dates": [375099],
    "screenshots": [803747, 803748, 803749, 803750, 803751],
    "similar_games": [
      13189, 25222, 27266, 55282, 75948, 87975, 96217, 106992, 111130, 121217
    ],
    "slug": "meat-and-greed",
    "summary": "In the atmospheric puzzle-platformer Meat & Greed, you will experience the horrors of a slaughterhouse from the perspective of different animals. Solve riddles and collaborate with other animals to try and escape this ill-fated factory.",
    "tags": [268435487, 268435488],
    "updated_at": 1691320285,
    "url": "https://www.igdb.com/games/meat-and-greed",
    "websites": [287410, 493202],
    "checksum": "ef9c19ef-0e29-409c-e77e-ed798eb59167",
    "language_supports": ["English"],
    "steam": "2009730",
    "reviews": [
      {
        "review": "It's quite short and is worth a go if you need reminding about the horrors of the meat industry. Pretty good for an EOY uni project, controls are slightly clunky and the camera clips into scenery occasionally but it incorporates a few different mechanics fairly well.",
        "author": "Lexington",
        "recommended": true,
        "postedDate": "9 June, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "This student game doesn't look good, moves too slowly, has bad puzzles, has bad check-pointing, and the theming felt under utilized and poorly expressed. The meat industry is super messed up but this game doesn't really concern itself with that past the superficial. Good effort by students but a bad use of your time.",
        "author": "Lackluster",
        "recommended": false,
        "postedDate": "21 June, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "Things I learned, don't trust chickens and these people are real slap dash with OSHA safety.",
        "author": "Kodiak-Rush",
        "recommended": true,
        "postedDate": "18 June, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "The story of a chicken escape, with a sea of blood, laziness and violence against animals.Pros:+ Unusual plot+ Availability: the game is freeMinuses:- Short game session- Does not support gamepad.Total:The game is not for children. A very short story with an open ending (?). The lack of a plot with inconsistencies in the game itself - creates a lot of questions that have no answers.The game is worth a try. Fortunately, the passage will take about 15-20 minutes.",
        "author": "Astaritus",
        "recommended": true,
        "postedDate": "13 June, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "Very good game! Takes a while to progress, there's not many areas to explore, and the puzzles aren't very hard, but it makes up for it in impressive level design. It shows off the horrors of what happens in a slaughterhouse amazingly! I hope they add onto the game a bit more. The only things I would recommend to be added to the game would be sprinting, more animals, and more areas to explore.",
        "author": "No0bguy827",
        "recommended": true,
        "postedDate": "28 July, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "has a glitch that leaves you able to let the cow live +1",
        "author": "FrankyFaster",
        "recommended": true,
        "postedDate": "5 September, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "nice live lessons i would never trust a chickens they will use me and ride me",
        "author": "missing baby",
        "recommended": true,
        "postedDate": "17 October, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "Full playthrough here w/ best ending:https://youtu.be/F-bbT-RM2HwI think the creators tried to make something tragic happen at the end, but you gotta be quicker than that. It's a pretty good lost viking 3d platformer-esque game where you use other characters mechanics to progress. The camera angle is actually the devil at some parts, but other then that it runs pretty smooth. I think I glitched what was supposed to happen, but it wasn't very difficult to do to be honest so meh no regrets.",
        "author": "The FluffeyPanda",
        "recommended": true,
        "postedDate": "7 June, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "It's a little glitchy, but the idea is very important and the character designs are very cute. Short game, but worth the play-through.",
        "author": "IceCoffee",
        "recommended": true,
        "postedDate": "11 July, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "Game co 6 nguoi lam the nay la gioi roi, co phai team nao cung 3 nguoi lam nen chuyen dau",
        "author": "NAD",
        "recommended": true,
        "postedDate": "7 June, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "ːyuiː Lᴏᴜɴɢᴇ ːeve_maryː Fᴀᴠᴏʀɪᴛᴇ ːcharlottecryː Nᴏᴛᴇ ːfrustrationː Cᴏᴍᴍᴇɴᴛs ːcon2_narikaː Mᴜʟᴛɪᴍᴇᴅɪᴀ ːlisaː Gʀᴏᴜᴘ ːchinatsuː Sᴇᴛᴜᴘ ːpnk_hrdː Tʀᴀᴅᴇ https://www.youtube.com/watch?v=ucI1GNzV7SM Nature, to be commanded, must be obeyed.  -- Francis Bacon#Discussions_QuoteBlock_Authorhttps://steamcommunity.com/id/byteframe/inventory/#753_6_12694164567ʕ•ᴥ•ʔ+ what is hacking- The attempt at gaining unauthorized access to files. https://store.steampowered.com/app/1631210/Be_My_Girlfriends/",
        "author": "¡ byteframe 🤕 is sightly !",
        "recommended": null,
        "postedDate": "13 November\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "I thought the idea was quiet interesting, but the clunky controls and glitches took me out of it.",
        "author": "Evgi",
        "recommended": null,
        "postedDate": "8 July, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      },
      {
        "review": "I guess there was one moment I thought was cool, but other than that it was a boring slog.",
        "author": "Tenderizer",
        "recommended": null,
        "postedDate": "2 July, 2022\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteam Key"
      }
    ]
  }
]
